{
  "author": "Terri Campbell",
  "relationship": "Aunt",
  "order": 11,
  "paragraphs": [
    "Before Alex got sick, my memories of him are sports and normal childhood antics between cousins... I remember him being in the hospital on his birthday, and getting the devastating news of his cancer diagnosis. I watched Linda hold it together, walk out to the hall to cry and compose herself, and come back into Alex to be there for him. Always. I brought in my remote fart machine, and we had fun pranking the doctors and staff. They had the fattest cat, Oreo, and I got a small Texas Longhorns shirt to put on the cat without telling Alex. He laughed so hard when the cat walked by! It was clear that Heavenly Father was watching out for Alex during such difficult times. I'd applied at JetBlue and had this strong confirmation that I would get the job... I did. Shortly after I received a company email saying JetBlue was \"The proud sponsor of the Texas Longhorns\". I noticed the name Marty St.George, Vice President of marketing. I naively emailed him and explained Alex was going through chemo, and it was rough. I told him about Alex's love of the Longhorns, and asked him if he came across memorabilia could he hang onto it and I'd pay for it and any shipping costs. To my surprise, I got a phone call from Marty's personal assistant asking if Alex could travel. If he couldn't, they offered to have the Longhorns mascot come to him! This is how Alex's trip to meet the team came about. As I hung up the phone, I was overcome with emotions and distinctly knew God had orchestrated these events even down to my job application, to bring joy to Alex. Another time I was headed to a store and wasn't paying attention. I realized instead of going west bound, I took the wrong exit and was going towards the U. I wasn't in a hurry and stayed on that route. My dad called and said Linda had called him, very upset, and Alex was being life-flighted to the U of U Hospital. Linda and Rob were driving in from American Fork and no one else was allowed in the helicopter. They feared Alex may not make it. I hung up with my dad and was right where I needed to be-- a couple of turns away from the U of U Hospital. I parked and walked in and without asking for directions, I saw the helicopter land and was in the right place as they wheeled Alex by me on a gurney. I got to touch him and say hi for a minute, and Linda & Rob arrived. It was heartbreaking to see them both kiss Alex and tell him goodbye as he was wheeled away, because we were well aware it could be the last time. Once again, I was overwhelmed and in awe of what God orchestrated for Alex, who surely is such a treasured soul to Him. I'm blessed to be Alex's aunt. I'm honored to be related to this Wernli Family. Who showed faith and character during so many hard times!"
  ]
}
